       01 FD-UNIAO.
           03 ID-ALUNO         PIC 9(03).
           03 NM-ALUNO         PIC A(20).
           03 TL-ALUNO         PIC A(09).
           03 ID-MATERIA       PIC 9(03).
           03 NM-MATERIA       PIC A(20).
           03 NT-APROVACAO     PIC 9(02)V2.
           03 MD-ALUNO         PIC 9(02)V2.
           03 ST-APROVACAO     PIC A(09).
