      ******************************************************************
      * Author:Uelber Pereira de Jesus
      * Date:30/05/2023
      * Purpose:Chamar programas externos
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MENUCNTT.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "FUNCIONANDO MENU CHAMADOR"
            STOP RUN.
       END PROGRAM MENUCNTT.
