       02 FL-MATERIA.
           03 ID-MATERIA           PIC 9(03).
           03 NM-MATERIA           PIC A(20).
           03 NT-APROVACAO         PIC 9(02)V2.
